Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
inp (InputLayer)                [(None, None, 257)]  0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, None, 512)    131584      inp[0][0]                        
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, None, 512)    1024        dense[0][0]                      
__________________________________________________________________________________________________
tf_op_layer_NotEqual (TensorFlo [(None, None, 257)]  0           inp[0][0]                        
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, None, 512)    0           layer_normalization[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Any (TensorFlowOpLa [(None, None)]       0           tf_op_layer_NotEqual[0][0]       
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 512)          4198400     re_lu[0][0]                      
__________________________________________________________________________________________________
add (Add)                       (None, None, 512)    0           re_lu[0][0]                      
                                                                 bidirectional[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 512)          4198400     add[0][0]                        
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 512)    0           add[0][0]                        
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 512)          4198400     add_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 512)    0           add_1[0][0]                      
                                                                 bidirectional_2[0][0]            
__________________________________________________________________________________________________
bidirectional_3 (Bidirectional) (None, 512)          4198400     add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 512)    0           add_2[0][0]                      
                                                                 bidirectional_3[0][0]            
__________________________________________________________________________________________________
bidirectional_4 (Bidirectional) (None, 512)          4198400     add_3[0][0]                      
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 512)    0           add_3[0][0]                      
                                                                 bidirectional_4[0][0]            
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, None, 257)    131841      add_4[0][0]                      
__________________________________________________________________________________________________
activation (Activation)         (None, None, 257)    0           time_distributed[0][0]           
==================================================================================================
Total params: 21,256,449
Trainable params: 21,256,449
Non-trainable params: 0
__________________________________________________________________________________________________
